#include <stdio.h>

 int main() {
    int x, base;
    int rate = 1;

     scanf("%d %d", &x, &base);

     for ( ; base * rate <= x; ) {
        rate *= base;
    }

     for ( ; rate > 1; ) {
        printf("%d", x/rate);
        if ( x / rate != 0 ) {
            x %= rate;
        }
        rate /= base;
    }
    printf("%d\n", x/rate);

     return 0;
}

/*
Задача base

Условие задачи
Считать с клавиатуры целое неотрицательное число в десятичной системе счисления
и основание новой системы счисления (целое число от 2 до 10).
Вывести в консоль число, записанное в новой системе счисления.
Задача решается без массивов.

Пример ввода
8 3
Пример вывода
22
*/
