#include <stdio.h>

int main() {
    int x, y;
    
    scanf("%d %d", &x, &y);
    
    if ( x > y && y > 0 ) {
        printf("alpha\n");
    } else if ( x < 0 && y == 0 ) {
        printf("bravo\n");
    } else if ( x == 0 || y == 0 ) {
        printf("charlie\n");
    } else {
        printf("zulu\n");
    }
    
    return 0;
}

/*
Задача abcz4

Условие задачи
Считать с клавиатуры два целых числа.
Программа должна произвести только одну из следующих операций:
- Если первое число больше второго и второе число больше нуля, вывести alpha
- Если первое число меньше нуля и второе число равно нулю, вывести bravo
- Если любое из чисел равно нулю, вывести charlie
- Если не сработало ничего из вышеуказанного, вывести zulu

Пример ввода
100 50
Пример вывода
alpha
*/
