#include <stdio.h>

int main() {
    int x, y, z;
    
    scanf("%d %d %d", &x, &y, &z);
    
    if ( x + y > z ) {
        printf("alpha\n");
    } else if ( x < y - z ) {
        printf("bravo\n");
    } else if ( y % z == 0 ) {
        printf("charlie\n");
    } else {
        printf("zulu\n");
    }
    
    return 0;
}

/*
Задача abcz3

Условие задачи
Считать с клавиатуры три целых не равных нулю числа.
Программа должна произвести только одну из следующих операций:
- Если сумма первого и второго чисел больше третьего числа, вывести alpha
- Если первое число меньше разности второго и третьего чисел, вывести bravo
- Если второе число кратно третьему, вывести charlie
- Если не сработало ничего из вышеуказанного, вывести zulu

Пример ввода
2 2 3
Пример вывода
alpha
*/
