#include <stdio.h>

int main() {
    int hours, monad;
    
    scanf("%d %d", &monad, &hours);
    
    for ( int hour = 1; hour <= hours; hour++ ) {
        monad *= 2;
        printf("%dh => %d amoeba(s)\n", hour, monad);
    }
    
    return 0;
}

/*
Задача amoeba

Условие задачи
Считать с клавиатуры два целых положительных числа - количество одноклеточных организмов в чашке Петри и количество часов - время проведения эксперимента. Каждый час, каждая клетка делится на 2 клетки. Вывести на экран количество клеток в чашке петри на каждый час эксперимента.

Пример ввода
5 2
Пример вывода
1h => 10 amoeba(s)
2h => 20 amoeba(s)
*/
