#include <stdio.h>

int main() {
    int count;
    
    scanf("%d", &count);
    
    for ( ; count > 0; count-- ) {
        printf("%d ", count);
    }
    
    printf("0\n");
}

/*
Задача countdown

Условие задачи
Считать с клавиатуры целое неотрицательное число.
Вывести в строку убывающий ряд чисел от заданного до нуля.

Пример ввода
7
Пример вывода
7 6 5 4 3 2 1 0
*/
