#include <stdio.h>

int main() {
    printf("Hello, world!\n");
    
    return 0;
}

/*
Задача hello

Условие задачи
Поприветствовать Бендера.

Пример вывода
Hello, Bender!
*/
