#include <stdio.h>

int main() {
    int a;
    
    scanf("%d", &a);
    
    if ( a % 2 == 0 ) {
        a += 1;
    }
    
    printf("%d\n", a);
    
    return 0;
}

/*
Задача nextOdd

Условие задачи
Считать целое число. Вывести на экран минимальное нечетное число, не меньшее введенного.

Пример ввода
8
Пример вывода
9
*/
