#include <stdio.h>

int main() {
    int a;
    
    scanf("%d", &a);
    
    if ( a % 2 == 0 ) {
        a -= 1;
    }
    
    printf("%d\n", a);
    
    return 0;
}

/*
Задача prevOdd

Условие задачи
Считать целое число. Вывести на экран максимальное нечетное число, не большее введенного.

Пример ввода
10
Пример вывода
9
*/
